Repository: frantischek/GameShell
Catalog: i18n/*.po
Languages: de

source: $GSH_ROOT/i18n/gameshell-full-help/en.txt
de: $GSH_ROOT/i18n/gameshell-full-help/de.txt

source: $GSH_ROOT/i18n/gameshell-help/en.txt
de: $GSH_ROOT/i18n/gameshell-help/de.txt

source: $GSH_ROOT/i18n/gameshell-init-msg-short/en.txt
de: $GSH_ROOT/i18n/gameshell-init-msg-short/de.txt

source: $GSH_ROOT/i18n/gameshell-init-msg/en.txt
de: $GSH_ROOT/i18n/gameshell-init-msg/de.txt

source: $GSH_ROOT/i18n/gameshell-welcome/en.txt
de: $GSH_ROOT/i18n/gameshell-welcome/de.txt

source: $GSH_ROOT/i18n/start-full-help/en.txt
de: $GSH_ROOT/i18n/start-full-help/de.txt

source: $GSH_ROOT/i18n/start-help/en.txt
de: $GSH_ROOT/i18n/start-help/de.txt

source: $MISSION_DIR/goal/en.txt
de: $MISSION_DIR/goal/de.txt

source: $MISSION_DIR/skip/en.txt
de: $MISSION_DIR/skip/de.txt

source: $MISSION_DIR/treasure-msg/en.txt
de: $MISSION_DIR/treasure-msg/de.txt

source: $nb_failed_tests failures out of $nb_tests tests
de: $nb_failed_tests Fehler bei $nb_tests Tests

source: $nb_tests successful tests
de: $nb_tests erfolgreiche Tests

source: %d authentification failure
de: %d Authentifizierungsfehler

source: %d mission cancelled for missing dependencies:
de: %d Mission wegen fehlender Abhängigkeiten abgebrochen:

source: %d mission passed using the auto.sh script:
de: %d Mission mit dem auto.sh-Skript bestanden:

source: %d mission passed:
de: %d Mission bestanden:

source: %d mission skipped:
de: %d Mission übersprungen:

source: AUTOMATICALLY GENERATED ON STARTUP -- DO NOT MODIFY
de: AUTOMATISCH BEIM START GENERIERT -- NICHT ÄNDERN

source: Available index files:
de: Verfügbare Indexdateien:

source: Congratulations, mission $MISSION_NB has been successfully completed!
de: Herzlichen Glückwunsch, Mission $MISSION_NB wurde erfolgreich abgeschlossen!

source: Error: _gsh_assert_check only accept 'true' and 'false' as argument.
de: Fehler: _gsh_assert_check akzeptiert nur 'true' und 'false' als Argument.

source: Error: a least one base function is not working properly. Aborting!
de: Fehler: Mindestens eine Basisfunktion funktioniert nicht richtig. Abbruch!

source: Error: couldn't get mission number $MISSION_NB (from $fn_name)
de: Fehler: Konnte Missionsnummer $MISSION_NB nicht abrufen (von $fn_name)

source: Error: invalid mode (option -M): '-$OPTARG'
de: Fehler: Ungültiger Modus (Option -M): '-$OPTARG'

source: Error: invalid option: '-$OPTARG'
de: Fehler: Ungültige Option: '-$OPTARG'

source: Error: missing parameter for option: '-$OPTARG'
de: Fehler: Fehlender Parameter für Option: '-$OPTARG'

source: Error: mission $MISSION_NB doesn't exist!
de: Fehler: Mission $MISSION_NB existiert nicht!

source: Error: mission $MISSION_NB doesn't have a test script.
de: Fehler: Mission $MISSION_NB hat kein Testskript.

source: Error: mission $MISSION_NB doesn't have an auto script.
de: Fehler: Mission $MISSION_NB hat kein automatisches Skript.

source: Error: mission $MISSION_NB is cancelled because some dependencies are not met.
de: Fehler: Mission $MISSION_NB wurde abgebrochen, da einige Abhängigkeiten nicht erfüllt sind.

source: Error: no mission was found! Aborting.
de: Fehler: Keine Mission gefunden! Abbruch.

source: Error: save mode can only be 'index', 'simple' or 'overwrite'
de: Fehler: Speichermodus kann nur 'index', 'simple' oder 'overwrite' sein

source: Error: the 'goto' command requires a mission number as argument.
de: Fehler: Der Befehl 'goto' benötigt eine Missionsnummer als Argument.

source: Error: the command 'gsh hardreset' shouldn't be run inside a subshell!
de: Fehler: Der Befehl 'gsh hardreset' sollte nicht in einer Subshell ausgeführt werden!

source: Error: the command 'gsh reset' shouldn't be run inside a subshell!
de: Fehler: Der Befehl 'gsh reset' sollte nicht in einer Subshell ausgeführt werden!

source: Error: this option is only available from an executable archive!
de: Fehler: Diese Option ist nur über ein ausführbares Archiv verfügbar!

source: Error: unknown gsh command '$cmd'. Use one of the following commands:
de: Fehler: Unbekannter gsh-Befehl '$cmd'. Verwenden Sie einen der folgenden Befehle:

source: Error: unknown shell '$SHELL'. Run GameShell with either bash or zsh.
de: Fehler: Unbekannte Shell '$SHELL'. Starten Sie GameShell mit bash oder zsh.

source: Error: wrong password.
de: Fehler: Falsches Passwort.

source: Error: you are not allowed to run this command.
de: Fehler: Sie haben keine Berechtigung, diesen Befehl auszuführen.

source: Error: you shouldn't run Gameshell as root!
de: Fehler: Sie sollten GameShell nicht als root ausführen!

source: Is this information correct? [Y/n]
de: Sind diese Informationen korrekt? [J/n]

source: Mission $MISSION_NB has been cancelled.
de: Mission $MISSION_NB wurde abgebrochen.

source: Player's email:
de: E-Mail des Spielers:

source: Player's name:
de: Name des Spielers:

source: Press Enter to continue.
de: Drücken Sie Enter, um fortzufahren.

source: START OF COMMANDS HISTORY
de: BEGINN DER BEFEHLSHISTORIE

source: Sorry, mission $MISSION_NB hasn't been completed.
de: Leider wurde Mission $MISSION_NB nicht abgeschlossen.

source: The directory $GSH_CONFIG contains meta-data from a previous game. Do you want to remove it and start a new game? [y/N]
de: Das Verzeichnis $GSH_CONFIG enthält Metadaten eines vorherigen Spiels. Möchten Sie diese entfernen und ein neues Spiel starten? [j/N]

source: The latest version of Gameshell is available at
de: Die neueste Version von GameShell ist verfügbar unter

source: There are stopped jobs in your session. Those processes will be terminated. You can get the list of those jobs with $ jobs Do you still want to quit? [y/n]
de: Es gibt angehaltene Aufgaben in Ihrer Sitzung. Diese Prozesse werden beendet. Sie können die Liste dieser Aufgaben mit folgendem Befehl abrufen: $ jobs Möchten Sie trotzdem beenden? [j/n]

source: Warning: command line arguments are ignored when continuing a game ($args)
de: Warnung: Kommandozeilenargumente werden beim Fortsetzen eines Spiels ignoriert ($args)

source: Warning: language is ignored when continuing a game ($args)
de: Warnung: Die Sprache wird beim Fortsetzen eines Spiels ignoriert ($args)

source: Warning: the file 'treasure.sh' was sourced from a subshell. You should use the command $ gsh reset
de: Warnung: Die Datei 'treasure.sh' wurde aus einer Subshell geladen. Sie sollten den folgenden Befehl verwenden: $ gsh reset

source: Warning: this mission was initialized in a subshell. Run the command $ gsh reset to make sure the mission is initialized properly.
de: Warnung: Diese Mission wurde in einer Subshell initialisiert. Führen Sie den Befehl $ gsh reset aus, um sicherzustellen, dass die Mission korrekt initialisiert wird.

source: While you are waiting, a bat flies by...
de: Während Sie warten, fliegt eine Fledermaus vorbei...

source: While you are waiting, a caterpillar crawls by...
de: Während Sie warten, kriecht eine Raupe vorbei...

source: While you are waiting, a centipede crawls by...
de: Während Sie warten, kriecht ein Tausendfüßler vorbei...

source: While you are waiting, a duck swims by...
de: Während Sie warten, schwimmt eine Ente vorbei...

source: While you are waiting, a fish swims by...
de: Während Sie warten, schwimmt ein Fisch vorbei...

source: While you are waiting, a large fish swims by...
de: Während Sie warten, schwimmt ein großer Fisch vorbei...

source: While you are waiting, a snail goes by...
de: Während Sie warten, kriecht eine Schnecke vorbei...

source: While you are waiting, a snake slithers by...
de: Während Sie warten, schlängelt sich eine Schlange vorbei...

source: While you are waiting, a spider crawls by...
de: Während Sie warten, krabbelt eine Spinne vorbei...

source: While you are waiting, an ant crawls by...
de: Während Sie warten, krabbelt eine Ameise vorbei...

source: While you are waiting, you see a fish swimming in circles...
de: Während Sie warten, sehen Sie einen Fisch im Kreis schwimmen...

source: Y
de: J

source: You left GameShell's directory structure. Use $ cd to go back to the GameShell's starting directory.
de: Sie haben die Verzeichnisstruktur von GameShell verlassen. Verwenden Sie $ cd um zum Startverzeichnis von GameShell zurückzukehren.

source: [Press space to continue, q to quit\.]
de: [Drücken Sie die Leertaste zum Fortfahren, q zum Beenden\.]

source: cancelled
de: abgebrochen

source: completed
de: abgeschlossen

source: days
de: Tage

source: failed
de: fehlgeschlagen

source: game time: %s in %d session
de: Spielzeit: %s in %d Sitzung

source: password:
de: Passwort:

source: progress was saved in $SAVEFILE
de: Der Fortschritt wurde in $SAVEFILE gespeichert

source: skipped
de: übersprungen

source: test $nb_tests failed
de: Test $nb_tests fehlgeschlagen

source: total time: %s
de: Gesamtzeit: %s

source: use 'gsh help' to get a list of available commands
de: Verwenden Sie 'gsh help', um eine Liste der verfügbaren Befehle zu erhalten

source: y
de: j
